---
kind: type
id: T:Autodesk.Revit.DB.GeometryObject
source: html/e0f15010-0e19-6216-e2f0-ab7978145daa.htm
---
# Autodesk.Revit.DB.GeometryObject

The common base class for all geometric primitives.

## Syntax (C#)
```csharp
public class GeometryObject : APIObject
```